<?php

return [
    'store-success'               => 'تم حفظ  بيانات المقاول بنجاح.',
    'store-failed'                => 'حدث خطأ أثناء الحفظ, برجاء المحاولة مرة أخري.',
    'update-success'              => 'تم تحديث بيانات المقاول بنجاح.',
    'update-failed'               => 'حدث خطأ أثناء التحديث, برجاء المحاولة مرة أخري.',
    'delete-success'              => 'تم حذف بيانات المقاول بنجاح.',
    'delete-failed'               => 'حدث خطأ أثناء الحذف, برجاء التأكد ان المقاول غير مرتبط بأي مركبات او عقود و المحاولة مرة أخري.',
    'validation_name_ar'          => 'يرجى كتابة حروف عربية فقط',
    'validation_name_en'          => 'يرجى كتابة حروف انجليزية فقط',
    'digit_start_with_zero'       => 'يجب ان يكون مكون من 10 ارقام ولا يبدأ بصفر',
    'validation_email'            => 'الرجاء ادخال صيغة بريد الكترونى صحيحة',
    'validation_default_contact'  => 'يجب ان يكون هناك مسئول اساسى واحد فقط',
    'validation_contact_name'     => 'اسم المسئول مسجل مسبقا',
    'delete-failed-units-exists'  => 'حذف المقاول سوف يقوم بحذف كل المركبات المتعلقة بيه !',
];
