<?php

return [
    'store-success'                    => 'تم حفظ الوظيفة بنجاح.',
    'store-failed'                     => 'حدث خطأ أثناء الحفظ, برجاء المحاولة مرة أخري.',
    'update-success'                   => 'تم تحديث الوظيفة بنجاح.',
    'update-failed'                    => 'حدث خطأ أثناء التحديث, برجاء المحاولة مرة أخري.',
    'delete-success'                   => 'تم حذف الوظيفة بنجاح.',
    'delete-failed'                    => 'حدث خطأ أثناء الحذف, برجاء التأكد ان الوظيفة غير مرتبطة بأي مستخدمبن و المحاولة مرة أخري.',
    'given_modules_not_available'      => 'بعض الموديولات المعطاة غير متواجدة بالنظام, برجاء التأكد من الموديولات.',
    'permissions_not_belong_to_module' => 'معرفات التصاريح لا تنتمي إلي الموديول المعطي.',
];
