<?php

return [
    'store-success'                  => 'تم حفظ المنطقة الجغرافية بنجاح.',
    'store-failed'                   => 'حدث خطأ أثناء الحفظ, برجاء المحاولة مرة أخري.',
    'update-success'                 => 'تم تحديث المنطقة الجغرافية بنجاح.',
    'update-failed'                  => 'حدث خطأ أثناء التحديث, برجاء المحاولة مرة أخري.',
    'delete-success'                 => 'تم حذف المنطقة الجغرافية بنجاح.',
    'delete-failed'                  => 'حدث خطأ أثناء الحذف، برجاء التأكد ان المنطقة الجعرافية لاتنتمى لنوع نفايات والمحاولة مرة اخرى',
    'delete-multi-success'           => 'تم حذف المنطقة الجغرافية بنجاح.',
];
