<?php

return [
    'store-success'  => 'تم حفظ المحطة الانتقالية بنجاح.',
    'store-failed'   => 'حدث خطأ أثناء الحفظ, برجاء المحاولة مرة أخري.',
    'update-success' => 'تم تحديث المحطة الانتقالية بنجاح.',
    'update-failed'  => 'حدث خطأ أثناء التحديث, برجاء المحاولة مرة أخري.',
    'delete-success' => 'تم حذف المحطة الانتقالية بنجاح.',
    'delete-failed'  => 'حدث خطأ أثناء الحذف ،برجاء التأكد  ان المحطة الانتقالية غير مرتبطة بأي عقد نشط و المحاولة مرة أخري.',
    'station_id'     => ':attribute غير متواجدة.',
];
